#+BEGIN_EXPORT html
<style>
  /* Existing CSS for alternating row colors */
  tr:nth-child(even) {
    background-color: #f2f2f2;
  }

  /* Right-align all table cells by default */
  td {
    text-align: right;
  }

  /* Left-align the first table cell */
  td:first-child {
    text-align: left !important;
  }

  /* Right-align all table headers by default */
  th {
    text-align: right;
  }

  /* Left-align the first table header */
  th:first-child {
    text-align: left !important;
  }
</style>

<script>
  document.addEventListener("DOMContentLoaded", function() {
    const tables = document.querySelectorAll("table");

    tables.forEach(table => {
      const headerRow = table.querySelector("tr");
      const columnHeader = headerRow ? headerRow.querySelectorAll("th")[1] : null;
      const isLatencyTable = columnHeader && columnHeader.textContent.includes("latency");

      const rows = table.querySelectorAll("tr");
      rows.forEach((row, index) => {
	if(index === 0) return;

	const cells = row.querySelectorAll("td");
	if(cells.length === 0) return;

	const percentageCell = cells[2];
	const percentage = parseFloat(percentageCell.textContent.trim());

	let baseColor, gradientColor;
	if (isLatencyTable) {
	  baseColor = percentage >= 0 ? 'rgba(255, 200, 200, 0.6)' : 'rgba(200, 255, 200, 0.6)';
	  gradientColor = percentage >= 0 ? 'rgba(255, 0, 0, 1)' : 'rgba(0, 255, 0, 1)';
	} else {
	  baseColor = percentage >= 0 ? 'rgba(200, 255, 200, 0.6)' : 'rgba(255, 200, 200, 0.6)';
	  gradientColor = percentage >= 0 ? 'rgba(0, 255, 0, 1)' : 'rgba(255, 0, 0, 1)';
	}

	const magnitude = Math.abs(percentage);
	const gradient = `linear-gradient(to left, ${gradientColor} 0%, ${gradientColor} ${magnitude}%, ${baseColor} ${magnitude}%, ${baseColor} 100%)`;

	percentageCell.style.background = gradient;
      });
    });
  });
</script>

#+END_EXPORT
* Requests/s
** http
| Release                            | request/s | % Diff from 4.13.8 |
|------------------------------------+-----------+--------------------|
| 4.13.0-0.nightly-2023-09-05-135358 |    167000 |               0.00 |
| 4.14.0-0.nightly-2023-09-02 132842 |    168000 |               0.60 |
#+TBLFM: $3=(($2 - @2$2) / @2$2) * 100;%.2f

** edge
| Release                            | request/s | % Diff from 4.13.8 |
|------------------------------------+-----------+--------------------|
| 4.13.0-0.nightly-2023-09-05-135358 |    116000 |               0.00 |
| 4.14.0-0.nightly-2023-09-02 132842 |    113000 |              -2.59 |
#+TBLFM: $3=(($2 - @2$2) / @2$2) * 100;%.2f

** reencrypt
| Release                            | reencrypt/s | % Diff from 4.13.8 |
|------------------------------------+-------------+--------------------|
| 4.13.0-0.nightly-2023-09-05-135358 |      100000 |               0.00 |
| 4.14.0-0.nightly-2023-09-02 132842 |       99500 |              -0.50 |
#+TBLFM: $3=(($2 - @2$2) / @2$2) * 100;%.2f

** passthrough
| Release                            | request/s | % Diff from 4.13.8 |
|------------------------------------+-----------+--------------------|
| 4.13.0-0.nightly-2023-09-05-135358 |    294000 |               0.00 |
| 4.14.0-0.nightly-2023-09-02 132842 |    292000 |              -0.68 |
#+TBLFM: $3=(($2 - @2$2) / @2$2) * 100;%.2f

* Latency
** http
| Release                            | P95 latency (ms) | % Diff from 4.13.8 |
|------------------------------------+------------------+--------------------|
| 4.13.0-0.nightly-2023-09-05-135358 |               26 |               0.00 |
| 4.14.0-0.nightly-2023-09-02 132842 |               29 |              11.54 |
#+TBLFM: $3=(($2 - @2$2) / @2$2) * 100;%.2f

** edge
| Release                            | P95 latency (ms) | % Diff from 4.13.8 |
|------------------------------------+------------------+--------------------|
| 4.13.0-0.nightly-2023-09-05-135358 |               38 |               0.00 |
| 4.14.0-0.nightly-2023-09-02 132842 |               46 |              21.05 |
#+TBLFM: $3=(($2 - @2$2) / @2$2) * 100;%.2f

** reencrypt
| Release                            | P95 latency (ms) | % Diff from 4.13.8 |
|------------------------------------+------------------+--------------------|
| 4.13.0-0.nightly-2023-09-05-135358 |               47 |               0.00 |
| 4.14.0-0.nightly-2023-09-02 132842 |               45 |              -4.26 |
#+TBLFM: $3=(($2 - @2$2) / @2$2) * 100;%.2f

** passthrough
| Release                            | P95 latency (ms) | % Diff from 4.13.8 |
|------------------------------------+------------------+--------------------|
| 4.13.0-0.nightly-2023-09-05-135358 |               19 |               0.00 |
| 4.14.0-0.nightly-2023-09-02 132842 |               16 |             -15.79 |
#+TBLFM: $3=(($2 - @2$2) / @2$2) * 100;%.2f


